Задача 1.  
Пусть xn = n(-1)**n. Доказать, что последовательность {xn}:  
а) неограниченная;  
б) не является бесконечно большой. 
  
Подставим значения вместо n:  
n = {1, 2, 3, 4}  
x1 = 0.1  
x2 = 2  
x3 = 0.3  
x4 = 4  
Получается последовательность:  
xn = {0.1, 2, 0.3, 4}  
Данная последовательность растет в одном направление и убывает в другом, следовательно данная последовательность не ограничена.  
Данная последовательность не является бесконечно большой, потому что не выполняется условие при котором для любого положительного числа A существует номер N такой,
что при n > N выполняется неравенство |xn| > A.  
Задача 2.  
Доказать, что последовательность {sin n} расходится.  
Для доказательства данной утверждения нужно доказать что данная последовательность не монотонная и не ограниченная.  
Подставим значения вместо n:  
n = {1, 2, 3, 4}  
Получается последовательность  
sinn = {0.0174, 0.0348, 0.0523, 0.0697}  
Получившиеся последовательность строго монотонная.  
А из связи между сходимостью и ограниченностью последовательностей следуют утверждения:   
1)Всякая сходящаяся последовательность является ограниченной.  
2)Всякая монотонная и ограниченная последовательность сходится.  
3)Всякая постоянная последовательность, члены которой равны a, сходятся к этому числу, т. е lim┬(n→∞)⁡〖a=a.〗 
Так как ни одно из утверждений не соответствует нашей последовательности делаем вывод что последовательность sinn расходиться и не имеет предела.  
Задача 3.  
1/n^m  = б. м. n □(→┴ ) ∞  
lim┬(n→∞)⁡〖б.м=0〗  
а) lim┬(n→∞)⁡〖10n/(n^2+1)〗 =[∞/∞] =(10n/n^2 )/((n^2+1)/n^2 ) = (10/n)/(1+ 1/n^2 ) = 0/1 = 0  
 В данном решение мы делим на наибольший элемент последовательности n2. В результате деления получается числитель 10/n и знаменатель 1/n^2
в которые если подставить значение бесконечности будут стремиться к нулю. В итоге получается предел равен 0  
б) lim┬(n→∞)⁡〖(n^2-n)/(n- √n)〗 = [∞/∞] = (n^2-n)/(n- √n) = ((n^2  -n)/n^2 )/((n - √n)/n^2 ) = (1 - 1/n  )/(1/n  - √n/n^2 ) = (1-0)/(0-0) = 1  
В данном решение мы делим на наибольший элемент последовательности n2. В результате деления получается в числителе 1/n и знаменателе √n/n^2 , 1/n 
которые если подставить значение бесконечности будут стремиться к нулю. В итоге получается предел равен 1.  
в) lim┬(n→∞)⁡〖(5 · 3^n)/(3^n-2)〗 =  [∞/∞] = ((5 · 3^n)/3^n )/((3^n-2)/3^n ) = 5/(1-2) = -5  
В данном решение мы делим на наибольший элемент последовательности 3n. В итоге получается предел равен -5.  
Задача 4.  
lim┬(n→∞)⁡〖(√(n^2+n)-n)〗 = [∞- ∞] = ((√(n^2+n)-n)(√(n^2+n)+ n))/((√(n^2+n)+n)) = 〖(√(n^2+n)- n)〗^2/((√(n^2+n)+ n)) = (n^2+ √n  - n^2)/(n+ √n+n) = √n/(2n+ √n) = 1/(2n/√n+1) = ∞  
В данном решение из формулы сокращенного умножения мы данное выражения до умножаем на сопряженное выражение только со знаком плюс. Далее числитель собирается в квадрат, знаменатель не изменяется.
Далее раскрываем скобки сокращаем степень и квадратный корень. Далее получившееся выражение делим на √n и получаем выражение 1/(2n/√n) знаменатель которого стремиться к бесконечности.
В итоге получается предел равен 1.  
Задача 5.  
lim┬(n→∞)⁡〖cos⁡(n)=1〗
lim┬(n→∞)⁡〖(√n  cos⁡n)/(n+1)〗 =  [∞/∞] = (√n  ·1)/(n+1) = ((√n  ·1)/√n)/((n+1)/√n) = 1/(n/√n+1/√n) = 0  
В данной примере при пределе cos(n) равному 1 получается выражение (√n  ·1)/(n+1), которое мы делим на общий делитель √n получается выражение 1/(n/√n+1/√n) знаменатель которого стремиться к 0. 
В итоги предел равен 0  

